/*
 Напишите программу,которая вводит с клавиатуры номер n дня в году (от1до365)
 и выводит день и месяц в виде двух чисел d и m (например, для n=33 вывести 3 2,так как 34-й день года—3 февраля).
*/

#include <iostream>

using namespace std;

int main()
{
    int n,m,d;
    cin >> n;
    d = 0;
    m = 1;
    while (n > 0) 
    {
        if ((m == 1) || (m == 3) || (m == 5) || (m == 7) || (m == 8) || (m == 10) || (m == 12))
            if (n > 31)
            {
                n = n - 31;
                m++;
            }
            else
            {
                d = n;
                n = 0;
                break;
            }
        if ((m == 4) || (m == 6) || (m == 9) || (m == 11))
            if (n > 30)
            {
                n = n - 30;
                m++;
            }
            else 
            {
                d = n;
                n = 0;
                break;
            }
        if (m == 2)
            if (n > 28) 
            {
                n = n - 28;
                m++;
            }
            else 
            {
                d = n;
                n = 0;
                break;
            }
    }
    cout << "DEN "<< d <<" MECYAC "<< m;
        

   
}