/*
 Напишите программу, которая вводит целое число n, 1⩽n⩽20, и 
 выводиттекстовоеполеразмераn×nизточекирешетоквшахматном порядке,
 причемвлевомверхнемуглунаходитсярешетка.Например, 
 дляn=5вывести 
 #.#.# 
 .#.#. 
 #.#.# 
 .#.#.
 #.#.#
*/

#include <iostream>

using namespace std;

int main() 
{
	int i,j,n;
    cin >> n;
    for (i = 1; i <= n; i++) 
    {
        for (j = 1; j <= n; j++) 
        {
            if (i % 2 == 1)
            {
                if (j % 2 == 1)
                    cout << "#";
                else cout << ".";
            }
            else
                if (j % 2 == 1)
                    cout << ".";
                else cout << "#";
        }
        cout << ""<< endl;
    }
}
